MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19195/mcu.h
extern volatile RE1PPSbits_t RE1PPSbits __at(0x1F31);
// bitfield macros
#define _RE1PPS_RE1PPS0_POSN                                0x0
#define _RE1PPS_RE1PPS0_POSITION                            0x0
#define _RE1PPS_RE1PPS0_SIZE                                0x1
#define _RE1PPS_RE1PPS0_LENGTH                              0x1
#define _RE1PPS_RE1PPS0_MASK                                0x1
#define _RE1PPS_RE1PPS1_POSN                                0x1
#define _RE1PPS_RE1PPS1_POSITION                            0x1
#define _RE1PPS_RE1PPS1_SIZE                                0x1
#define _RE1PPS_RE1PPS1_LENGTH                              0x1
#define _RE1PPS_RE1PPS1_MASK                                0x2
#define _RE1PPS_RE1PPS2_POSN                                0x2
#define _RE1PPS_RE1PPS2_POSITION                            0x2
#define _RE1PPS_RE1PPS2_SIZE                                0x1
#define _RE1PPS_RE1PPS2_LENGTH                              0x1
#define _RE1PPS_RE1PPS2_MASK                                0x4
#define _RE1PPS_RE1PPS3_POSN                                0x3
#define _RE1PPS_RE1PPS3_POSITION                            0x3
#define _RE1PPS_RE1PPS3_SIZE                                0x1
#define _RE1PPS_RE1PPS3_LENGTH                              0x1
#define _RE1PPS_RE1PPS3_MASK                                0x8
#define _RE1PPS_RE1PPS4_POSN                                0x4
#define _RE1PPS_RE1PPS4_POSITION                            0x4
#define _RE1PPS_RE1PPS4_SIZE                                0x1
#define _RE1PPS_RE1PPS4_LENGTH                              0x1
#define _RE1PPS_RE1PPS4_MASK                                0x10
#define _RE1PPS_RE1PPS5_POSN                                0x5
#define _RE1PPS_RE1PPS5_POSITION                            0x5
#define _RE1PPS_RE1PPS5_SIZE                                0x1
#define _RE1PPS_RE1PPS5_LENGTH                              0x1
#define _RE1PPS_RE1PPS5_MASK                                0x20

// Register: RE3PPS
#define RE3PPS RE3PPS
extern volatile unsigned char           RE3PPS              __at(0x1F33);
#ifndef _LIB_BUILD
asm("RE3PPS equ 01F33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE3PPS0                :1;
        unsigned RE3PPS1                :1;
        unsigned RE3PPS2                :1;
        unsigned RE3PPS3                :1;
        unsigned RE3PPS4                :1;
        unsigned RE3PPS5                :1;
    };
} RE3PPSbits_t;
extern volatile RE3PPSbits_t RE3PPSbits __at(0x1F33);
// bitfield macros
#define _RE3PPS_RE3PPS0_POSN                                0x0
#define _RE3PPS_RE3PPS0_POSITION                            0x0
#define _RE3PPS_RE3PPS0_SIZE                                0x1
#define _RE3PPS_RE3PPS0_LENGTH                              0x1
#define _RE3PPS_RE3PPS0_MASK                                0x1
#define _RE3PPS_RE3PPS1_POSN                                0x1
#define _RE3PPS_RE3PPS1_POSITION                            0x1
#define _RE3PPS_RE3PPS1_SIZE                                0x1
#define _RE3PPS_RE3PPS1_LENGTH                              0x1
#define _RE3PPS_RE3PPS1_MASK                                0x2
#define _RE3PPS_RE3PPS2_POSN                                0x2
#define _RE3PPS_RE3PPS2_POSITION                            0x2
#define _RE3PPS_RE3PPS2_SIZE                                0x1
#define _RE3PPS_RE3PPS2_LENGTH                              0x1
#define _RE3PPS_RE3PPS2_MASK                                0x4
#define _RE3PPS_RE3PPS3_POSN                                0x3
#define _RE3PPS_RE3PPS3_POSITION                            0x3
#define _RE3PPS_RE3PPS3_SIZE                                0x1
#define _RE3PPS_RE3PPS3_LENGTH                              0x1
#define _RE3PPS_RE3PPS3_MASK                                0x8
#define _RE3PPS_RE3PPS4_POSN                                0x4
#define _RE3PPS_RE3PPS4_POSITION                            0x4
#define _RE3PPS_RE3PPS4_SIZE                                0x1
#define _RE3PPS_RE3PPS4_LENGTH                              0x1
#define _RE3PPS_RE3PPS4_MASK                                0x10
#define _RE3PPS_RE3PPS5_POSN                                0x5
#define _RE3PPS_RE3PPS5_POSITION                            0x5
#define _RE3PPS_RE3PPS5_SIZE                                0x1
#define _RE3PPS_RE3PPS5_LENGTH                              0x1
#define _RE3PPS_RE3PPS5_MASK                                0x20

// Register: RE4PPS
#define RE4PPS RE4PPS
extern volatile unsigned char           RE4PPS              __at(0x1F34);
#ifndef _LIB_BUILD
asm("RE4PPS equ 01F34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE4PPS0                :1;
        unsigned RE4PPS1                :1;
        unsigned RE4PPS2                :1;
        unsigned RE4PPS3                :1;
        unsigned RE4PPS4                :1;
        unsigned RE4PPS5                :1;
    };
} RE4PPSbits_t;
extern volatile RE4PPSbits_t RE4PPSbits __at(0x1F34);
// bitfield macros
#define _RE4PPS_RE4PPS0_POSN                                0x0
#define _RE4PPS_RE4PPS0_POSITION                            0x0
#define _RE4PPS_RE4PPS0_SIZE                                0x1
#define _RE4PPS_RE4PPS0_LENGTH                              0x1
#define _RE4PPS_RE4PPS0_MASK                                0x1
#define _RE4PPS_RE4PPS1_POSN                                0x1
#define _RE4PPS_RE4PPS1_POSITION                            0x1
#define _RE4PPS_RE4PPS1_SIZE                                0x1
#define _RE4PPS_RE4PPS1_LENGTH                              0x1
#define _RE4PPS_RE4PPS1_MASK                                0x2
#define _RE4PPS_RE4PPS2_POSN                                0x2
#define _RE4PPS_RE4PPS2_POSITION                            0x2
#define _RE4PPS_RE4PPS2_SIZE                                0x1
#define _RE4PPS_RE4PPS2_LENGTH                              0x1
#define _RE4PPS_RE4PPS2_MASK                                0x4
#define _RE4PPS_RE4PPS3_POSN                                0x3
#define _RE4PPS_RE4PPS3_POSITION                            0x3
#define _RE4PPS_RE4PPS3_SIZE                                0x1
#define _RE4PPS_RE4PPS3_LENGTH                              0x1
#define _RE4PPS_RE4PPS3_MASK                                0x8
#define _RE4PPS_RE4PPS4_POSN                                0x4
#define _RE4PPS_RE4PPS4_POSITION                            0x4
#define _RE4PPS_RE4PPS4_SIZE                                0x1
#define _RE4PPS_RE4PPS4_LENGTH                              0x1
#define _RE4PPS_RE4PPS4_MASK                                0x10
#define _RE4PPS_RE4PPS5_POSN                                0x5
#define _RE4PPS_RE4PPS5_POSITION                            0x5
#define _RE4PPS_RE4PPS5_SIZE                                0x1
#define _RE4PPS_RE4PPS5_LENGTH                              0x1
#define _RE4PPS_RE4PPS5_MASK                                0x20

