MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19195/mcu.h
extern volatile ODCONEbits_t ODCONEbits __at(0x1F66);
// bitfield macros
#define _ODCONE_ODCE0_POSN                                  0x0
#define _ODCONE_ODCE0_POSITION                              0x0
#define _ODCONE_ODCE0_SIZE                                  0x1
#define _ODCONE_ODCE0_LENGTH                                0x1
#define _ODCONE_ODCE0_MASK                                  0x1
#define _ODCONE_ODCE1_POSN                                  0x1
#define _ODCONE_ODCE1_POSITION                              0x1
#define _ODCONE_ODCE1_SIZE                                  0x1
#define _ODCONE_ODCE1_LENGTH                                0x1
#define _ODCONE_ODCE1_MASK                                  0x2
#define _ODCONE_ODCE3_POSN                                  0x3
#define _ODCONE_ODCE3_POSITION                              0x3
#define _ODCONE_ODCE3_SIZE                                  0x1
#define _ODCONE_ODCE3_LENGTH                                0x1
#define _ODCONE_ODCE3_MASK                                  0x8
#define _ODCONE_ODCE4_POSN                                  0x4
#define _ODCONE_ODCE4_POSITION                              0x4
#define _ODCONE_ODCE4_SIZE                                  0x1
#define _ODCONE_ODCE4_LENGTH                                0x1
#define _ODCONE_ODCE4_MASK                                  0x10
#define _ODCONE_ODCE5_POSN                                  0x5
#define _ODCONE_ODCE5_POSITION                              0x5
#define _ODCONE_ODCE5_SIZE                                  0x1
#define _ODCONE_ODCE5_LENGTH                                0x1
#define _ODCONE_ODCE5_MASK                                  0x20
#define _ODCONE_ODCE6_POSN                                  0x6
#define _ODCONE_ODCE6_POSITION                              0x6
#define _ODCONE_ODCE6_SIZE                                  0x1
#define _ODCONE_ODCE6_LENGTH                                0x1
#define _ODCONE_ODCE6_MASK                                  0x40
#define _ODCONE_ODCE7_POSN                                  0x7
#define _ODCONE_ODCE7_POSITION                              0x7
#define _ODCONE_ODCE7_SIZE                                  0x1
#define _ODCONE_ODCE7_LENGTH                                0x1
#define _ODCONE_ODCE7_MASK                                  0x80

// Register: SLRCONE
#define SLRCONE SLRCONE
extern volatile unsigned char           SLRCONE             __at(0x1F67);
#ifndef _LIB_BUILD
asm("SLRCONE equ 01F67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRE0                  :1;
        unsigned SLRE1                  :1;
        unsigned                        :1;
        unsigned SLRE3                  :1;
        unsigned SLRE4                  :1;
        unsigned SLRE5                  :1;
        unsigned SLRE6                  :1;
        unsigned SLRE7                  :1;
    };
} SLRCONEbits_t;
extern volatile SLRCONEbits_t SLRCONEbits __at(0x1F67);
// bitfield macros
#define _SLRCONE_SLRE0_POSN                                 0x0
#define _SLRCONE_SLRE0_POSITION                             0x0
#define _SLRCONE_SLRE0_SIZE                                 0x1
#define _SLRCONE_SLRE0_LENGTH                               0x1
#define _SLRCONE_SLRE0_MASK                                 0x1
#define _SLRCONE_SLRE1_POSN                                 0x1
#define _SLRCONE_SLRE1_POSITION                             0x1
#define _SLRCONE_SLRE1_SIZE                                 0x1
#define _SLRCONE_SLRE1_LENGTH                               0x1
#define _SLRCONE_SLRE1_MASK                                 0x2
#define _SLRCONE_SLRE3_POSN                                 0x3
#define _SLRCONE_SLRE3_POSITION                             0x3
#define _SLRCONE_SLRE3_SIZE                                 0x1
#define _SLRCONE_SLRE3_LENGTH                               0x1
#define _SLRCONE_SLRE3_MASK                                 0x8
#define _SLRCONE_SLRE4_POSN                                 0x4
#define _SLRCONE_SLRE4_POSITION                             0x4
#define _SLRCONE_SLRE4_SIZE                                 0x1
#define _SLRCONE_SLRE4_LENGTH                               0x1
#define _SLRCONE_SLRE4_MASK                                 0x10
#define _SLRCONE_SLRE5_POSN                                 0x5
#define _SLRCONE_SLRE5_POSITION                             0x5
#define _SLRCONE_SLRE5_SIZE                                 0x1
#define _SLRCONE_SLRE5_LENGTH                               0x1
#define _SLRCONE_SLRE5_MASK                                 0x20
#define _SLRCONE_SLRE6_POSN                                 0x6
#define _SLRCONE_SLRE6_POSITION                             0x6
#define _SLRCONE_SLRE6_SIZE                                 0x1
#define _SLRCONE_SLRE6_LENGTH                               0x1
#define _SLRCONE_SLRE6_MASK                                 0x40
#define _SLRCONE_SLRE7_POSN                                 0x7
#define _SLRCONE_SLRE7_POSITION                             0x7
#define _SLRCONE_SLRE7_SIZE                                 0x1
#define _SLRCONE_SLRE7_LENGTH                               0x1
#define _SLRCONE_SLRE7_MASK                                 0x80

// Register: INLVLE
#define INLVLE INLVLE
extern volatile unsigned char           INLVLE              __at(0x1F68);
#ifndef _LIB_BUILD
asm("INLVLE equ 01F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLE0                :1;
        unsigned INLVLE1                :1;
        unsigned                        :1;
        unsigned INLVLE3                :1;
        unsigned INLVLE4                :1;
        unsigned INLVLE5                :1;
        unsigned INLVLE6                :1;
        unsigned INLVLE7                :1;
    };
} INLVLEbits_t;
extern volatile INLVLEbits_t INLVLEbits __at(0x1F68);
// bitfield macros
#define _INLVLE_INLVLE0_POSN                                0x0
#define _INLVLE_INLVLE0_POSITION                            0x0
#define _INLVLE_INLVLE0_SIZE                                0x1
#define _INLVLE_INLVLE0_LENGTH                              0x1
#define _INLVLE_INLVLE0_MASK                                0x1
#define _INLVLE_INLVLE1_POSN                                0x1
#define _INLVLE_INLVLE1_POSITION                            0x1
#define _INLVLE_INLVLE1_SIZE                                0x1
#define _INLVLE_INLVLE1_LENGTH                              0x1
#define _INLVLE_INLVLE1_MASK                                0x2
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8
#define _INLVLE_INLVLE4_POSN                                0x4
#define _INLVLE_INLVLE4_POSITION                            0x4
#define _INLVLE_INLVLE4_SIZE                                0x1
#define _INLVLE_INLVLE4_LENGTH                              0x1
#define _INLVLE_INLVLE4_MASK                                0x10
#define _INLVLE_INLVLE5_POSN                                0x5
#define _INLVLE_INLVLE5_POSITION                            0x5
#define _INLVLE_INLVLE5_SIZE                                0x1
#define _INLVLE_INLVLE5_LENGTH                              0x1
#define _INLVLE_INLVLE5_MASK                                0x20
#define _INLVLE_INLVLE6_POSN                                0x6
#define _INLVLE_INLVLE6_POSITION                            0x6
#define _INLVLE_INLVLE6_SIZE                                0x1
#define _INLVLE_INLVLE6_LENGTH                              0x1
#define _INLVLE_INLVLE6_MASK                                0x40
#define _INLVLE_INLVLE7_POSN                                0x7
#define _INLVLE_INLVLE7_POSITION                            0x7
#define _INLVLE_INLVLE7_SIZE                                0x1
#define _INLVLE_INLVLE7_LENGTH                              0x1
#define _INLVLE_INLVLE7_MASK                                0x80

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0x1F69);
#ifndef _LIB_BUILD
asm("IOCEP equ 01F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCEP0                 :1;
        unsigned IOCEP1                 :1;
        unsigned IOCEP2                 :1;
        unsigned IOCEP3                 :1;
        unsigned IOCEP4                 :1;
        unsigned IOCEP5                 :1;
        unsigned IOCEP6                 :1;
        unsigned IOCEP7                 :1;
    };
} IOCEPbits_t;
